[
    {
        "id": "Robo-Neko",
        "name": "Robo Neko",
        "projectYearMonth": "May 2025",
        "collaborator": "Jou-An Chen, Qiyuan Zhou, Nicholas Huang",
        "highlight": "This project was presented at the 106th NY Hardware Meetup and the Teardown 2025, Portland.",
        "intro": "Robo Neko is an interactive desktop robot with customized personality, designed to provide emotional support, companionship, and a fun way to teach children about pet care. We used a combination of standard PLA and conductive PLA to 3D print the cat, allowing it to sense touch while maintaining an aesthetically appealing appearance.",
        "tags": [
            "Ubiquitous Computing",
            "Human-Robot Interaction",
            "Digital Fabrication"
        ],
        "details": "In a world increasingly driven by fast-paced digital interactions, many people, especially children and the elderly, find themselves in need of companionship that is emotionally supportive yet low-pressure. RoboNeko is our response to that need: a small, expressive robotic cat designed to offer meaningful interaction through simple, tactile engagement. Inspired by nostalgic digital companions like Tamagotchi and Travel Frog, RoboNeko combines the emotional warmth of a pet with the simplicity and accessibility of a toy. <br><br>Unlike traditional robotic pets, RoboNeko introduces a gamified intimacy system and personalized petting preferences, making each interaction feel unique and emotionally resonant. Users build a relationship with RoboNeko by discovering how it likes to be pet—gaining trust and unlocking rewards like themed digital postcards. Through its responsive physical movements, sounds, and evolving personality, RoboNeko encourages empathy, patience, and emotional connection. <br><br>Our project blends playful design, social robotics, and emotional computing into a compact, low-maintenance companion that brings joy to users of all ages. Whether teaching children about pet care or providing comfort to those experiencing loneliness, RoboNeko aims to reimagine how we connect with technology and with ourselves. <br><br><img src='images/Robo-Neko/storyboard.png'><br><br>RoboNeko, as a companion social robot, is designed with a visually appealing appearance to encourage users to form an emotional connection with it. To align with the theme of sending postcards to users, the cat carries a camera around its neck. The design consists of multiple separate components, including two movable parts (the hands and tail) and five conductive touch-sensing areas (the ears, chin, belly, and back). These parts are printed individually and assembled after wiring for their specific functions.",
        "video":"https://youtube.com/embed/e9SBmivSKDY",
        "shorts": false,
        "otherMaterials": [
            {
                "name": "PDF",
                "link": "files/RoboNeko_Writeup.pdf"
            }
        ],
        "selected": true,
        "pinned": true
    },
    {
        "id": "Smart-Glove",
        "name": "ADAPT Smart Glove",
        "projectYearMonth": "May 2025",
        "collaborator": "",
        "highlight": "This project won the First Prize in the Autodesk Instructables Make it Wearable Contest. <br>This project was presented at the 106th NY Hardware Meetup.",
        "intro": "Smart Glove is a wearable assistive device that helps users interact with smart home technologies through touch and audio feedback. It is designed for people with disabilities (intellectual/developmental disability, visual impairments, reading difficulties), older adults, and those who need hands-on guidance to learn smart home technologies intuitively. User could simply wear the gloves and touch different parts of the smart technologies (e.g., button, knob, screen) and they will receive audio instructions on how to operate the machine.",
        "tags": [
            "Ubiquitous Computing"
        ],
        "details": "In this project, we collaborated with ADAPT Community Network to design a learning tool for the Smart Lab—a space created for visitors to explore and understand smart technologies. This challenge led us to develop the Smart Glove, a simple and intuitive solution.<br><br>The idea for the Smart Glove stemmed from my experience interviewing older adults and individuals with mild cognitive impairment. Many of them struggle to use devices with multiple buttons and complex interfaces. For example, laundry machines often have confusing controls, making it difficult to understand the correct sequence of operations. That’s where the Smart Glove comes in. By simply wearing the glove and interacting with the device, users can learn what each button does without actually activating them—avoiding unintended actions. The Smart Glove offers a risk-free way for users to build confidence in using technology.<br><br><img src='images/Smart-Glove/usermap.png' width=800><br><br>The Smart Glove utilizes Near Field Communication (NFC) technology, with the sensing area repositioned to the fingertip to detect NFC stickers on existing devices. It then provides audio instructions through speakers or headphones. <br><br>While this prototype is primarily intended for display and educational use in the Smart Lab, we envision future versions being used in senior centers, assisted living facilities, and other personal living environments.",
        "video":"https://youtube.com/embed/do_Suy_QJ84",
        "shorts": false,
        "otherMaterials": [
            {
                "name": "Instructables",
                "link": "https://www.instructables.com/Smart-Glove-an-Interactive-Manual-on-Hand/"
            }
        ],
        "selected": true,
        "pinned": true
    },
    {
        "id": "Taiwan-Classic-Pinball",
        "name": "Taiwan Classic Pinball",
        "projectYearMonth": "Mar 2025",
        "collaborator": "Jou-An Chen",
        "highlight": "",
        "intro": "Pinball is a classic and traditional game in many night markets across Taiwan. It is a tabletop game where players launch small marbles onto a tilted board, aiming to land them in numbered or colored holes. Traditionally, players use a Mahjong ruler to shoot the marble, trying to land the marbles either very focused or very scattered to win the best prize. In this project, we fabricated a pinball game board mainly by laser cutting featuring an embedded CLUE board and LEDs to enhance interactivity and engagement.",
        "tags": [
            "Ubiquitous Computing",
            "Digital Fabrication"
        ],
        "details": "<img src='images/Taiwan-Classic-Pinball/story_board.jpeg' width=600px></img>",
        "video":"https://youtube.com/embed/dZYW2Gougwk",
        "shorts": false,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": false
    },
    {
        "id": "Amber-Puzzle-Box",
        "name": "Amber Puzzle Box",
        "projectYearMonth": "Feb 2025",
        "collaborator": "",
        "highlight": "This project won the Judges' Prize in the Autodesk Instructables All Things Pi Contest.",
        "intro": "Inspired by the delicate woodwork of a Yosegi puzzle box, I decided to work on a laser-cut version of the puzzle box. Yosegi-Zaiku（寄木細工）is a Japanese woodwork technique that utilizes the different colors of various types of wood to create geometric patterns on the wood surface. Traditional Yosegi Puzzle Boxes are mostly rectangular boxes, usually taking 4-27 steps to solve them. In my laser-cut version, I kept the repetitive geometric pattern and the puzzle elements to retain the Yosegi-like features and build a round shape box with self-designed mechanisms to ensure its uniqueness and originality. To match the theme of the rounded shape box, I utilized the spinning (rotating) feature and embedded a roller-bearing into the design. The mechanism features a box with an interlocking structure, and two additional layers of puzzle -- the nail stopper and the spinning magnet key.",
        "tags": [
            "Digital Fabrication"
        ],
        "details": "The mechanism of the puzzle box can be divided into three parts: <b> the interlocking box, the nail stopper, and the spinning magnet key </b>. The bottom layer of the puzzle - the interlocking box, requires rotating the lid to a certain degree to pull the lid up. To lock this box, I added a nail stopper and two slots in the middle layer. To ensure the durability of the stopper, instead of assembling using wood sticks, the nail stopper is 3D-printed using PLA. To lift the nails from the slots, I decided to embed a small magnet on the upper layer; therefore, it will require attaching a thin piece of metal on the top of the nails to allow magnetic attraction (here I use the leg of a fastener). <br><br> The top layer was originally designed as a spinning plate that requires the player to spin the plate to the designated angle to lift the nails. However, as a puzzle, I figured the solution should be more complicated. Therefore, I changed the design to a 3-layer structure. The player will have to move the part with the magnet embedded from the first layer to the last layer, which is right above the magnetic nails to allow the magnetic force to lift the nails. I designed the moving part (the magnet keys) to be hidden in the top-most layer to maintain the cylinder shape when the box is locked, making it a bit tricky to directly pull it out. To move the part easily, the player can simply spin the plate quickly, <b>the centrifugal force</b> will bring the part with the magnet to the outer track, thus falling to the bottom layer. <br><br> One thing worth noting is that I designed the parts to be connected with the box at all times, which could greatly reduce the risk of the player losing any small parts when solving the puzzle, simply moving the part correctly without removing it will lead the player to solve the puzzle.",
        "video":"https://youtube.com/embed/4-LnBQ3DmpA",
        "shorts": false,
        "otherMaterials": [
            {
                "name": "Instructables",
                "link": "https://www.instructables.com/Designing-a-Laser-cut-Version-of-a-Yosegi-Puzzle-B/"
            }
        ],
        "selected": true,
        "pinned": true
    },
    {
        "id": "Snack-Keeper",
        "name": "Snack Keeper",
        "projectYearMonth": "Feb 2025",
        "collaborator": "",
        "highlight": "",
        "intro": "Snack Keeper is a device designed to limit the number of times I open my snack cabinet to check or get snacks. The screen on the device will show the count of door being opened, once the door open count reached to two, a motor-controlled latch will locked the door for a set amount of time. ",
        "tags": [
            "Ubiquitous Computing",
            "Digital Fabrication"
        ],
        "details": "Snack Keeper is a smart device meant to be set up on the kitchen overhead cabinet, which has been used as a snack cabinet. I used to check the snack cabinet every day and sometimes get some snacks, this bad habit caused me to eat more snacks than I was supposed to. As I am now on a healthy diet, my roommate and I set up a rule for opening the snack cabinet, which is to limit the door opening time to twice. The Snack Keeper is a physical device to realize this idea. I used the on-board accelerometer to detect door movements and connect a servo motor to control a door latch. Once the door opening time reaches 2, the door will be locked for 24 hours.<br><br> The door opening detection requires testing in the actual environment (i.e., on the cabinet). I tested the x-accelerometer to get a threshold of detecting as the door opened.The Snack Keeper has two statuses: locked and not locked. Snack Keeper is designed to present different information in these two states. Under the ‘not locked’ state, the screen will show the count of the door being opened with the latch staying up; under the ‘locked’ state, the screen will display the time until the next time the Snack Keeper is unlocked. Once the Snack Keeper enters the locked state, a timestamp is recorded, and the remaining locked time is calculated using the set locked time and the timestamp’s difference with the current time (i.e., 86400 – (current time – locked timestamp)). In case of special needs to open the cabinet while it’s locked, I designed a temporary unlock function that requires the user to press buttons A and B simultaneously, the latch will lift for a short time without affecting the remaining locked time after it’s locked again.",
        "video":"https://youtube.com/embed/NMd0nqIMXc4?si=R9dacSJXgliFRTlI",
        "shorts": true,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": false
    },
    {
        "id": "Walkwise",
        "name": "Walkwise",
        "projectYearMonth": "Dec 2024",
        "collaborator": "Nebil  Oumer, Didem Ergin, Qiyuan Zhou",
        "highlight": "",
        "intro": "WalkWise is a conceptual product that is designed as a rollator walker add-on to guide older adults safely using a laser projector.",
        "tags": [
            "Ubiquitous Computing"
        ],
        "details": "In this project, we worked with Weill Cornell to take on the challenge - 'How might we use technology to support the everyday life for older people with cognitive deficits (e.g. mild cognitive impairment) so they remain independent?' Our idea, Walkwise, is a laser-guidance walker add-on designed to support older adults with cognitive deficits. It aims to address mobility challenges and the fear of disorientation through features like route projection, caregiver connection, and gamification. The solution leverages IoT and embedded systems, using readily available components such as GPS sensors and e-SIM for real-time tracking. <br><img src='images/Walkwise/walkwise_feature.png' width=800>",
        "video":"",
        "shorts": false,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": false
    },
    {
        "id": "Pong-Soccer",
        "name": "Pong Soccer",
        "projectYearMonth": "Dec 2024",
        "collaborator": "Jou-An Chen, Qiyuan Zhou, Nicholas Huang, Siyan Wang",
        "highlight": "",
        "intro": "Pong Soccer is an interactive robot game designed for the K-12 initiative. Students are divided into two teams, yellow and blue, competing to score goals. The game’s objective is to guide a robot equipped with a soccer bin to the opposing team’s goal by throwing ping-pong balls into designated bins.",
        "tags": [
            "Human-Robot Interaction"
        ],
        "details": "The inspiration for the robot’s behavior draws from popular sports such as soccer, basketball, and ping pong. In this game, the robot mimics the behavior of a soccer ball, with the participants acting as players who, instead of kicking a ball, throw ping-pong balls into the robot’s designated bins to control its movement on the field. <br><br> The robot interacts with players through a combination of movement, lights, and sound. At the start of the game, the robot emits a honking sound to signal the start of the game. When a player throws a ball into the yellow bin, the robot responds with a “yellow team scores” audio, accompanied by a yellow light flash and movement toward the blue team’s goal. Similarly, when a ball is thrown into the blue team’s bin, the robot moves toward the yellow team’s goal and signals with blue lights and sound. When a team scores by reaching the opposing team’s goal, the robot announces the score with a corresponding sound and flashes the team’s color lights multiple times to celebrate the achievement. <br><br> The robot control architecture is made up of three subsystems: <b> the Ball Detection Subsystem, the Navigate Subsystem, and the Communication Subsystem </b>. The Ball Detection and Communication Subsystems run on a Raspberry Pi, which is connected to two motion sensors placed on either side of the soccer bin. These sensors detect when a ball enters the bin by measuring if the proximity exceeds a set threshold. Once a ball is detected, the Raspberry Pi sends a WebSocket message to the ROS2 node on the TurtleBot4 robot. The robot then uses this message to decide the direction and distance it needs to move. The Raspberry Pi server also keeps track of how many times each team scores to determine the winner. This architecture decouples the robot’s navigation and sensor detection subsystems, making it well-suited for the game by allowing greater flexibility and robustness in using sensor data. It ensures real-time responsiveness to player actions while providing reliable and accurate detection.",
        "video":"https://youtube.com/embed/c-LI4i0e-zc",
        "shorts": true,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": true
    },
    {
        "id": "Gazo",
        "name": "Gazo",
        "projectYearMonth": "Jul 2024",
        "collaborator": "",
        "highlight": "This project was presented at Neuroscience 2024, Chicago.",
        "intro": "Gazo is a 3D-printed EEG-based BCI device that features a portable, standalone, and monocle design. Gazo, consisting of a sensing headset, a display module ,and an EEG expansion module, is designed to accommodate a wide range of use cases that require mobile EEG capabilities.",
        "tags": [
            "Brain-Computer Interface",
            "Digital Fabrication",
            "Ubiquitous Computing"
        ],
        "details": "This study designed and 3D-printed a <b>portable, standalone, and monocle electroencephalogram (EEG)-based brain-computer interface (BCI) system</b>, named Gazo, to assess the feasibility of a see-through steady state visually evoked potentials (SSVEP) paradigm. Gazo consists of one sensing headset and one display module. The sensing headset can not only read 3-channels EEGs located on the occipital lobe but also, with the expansion module applied, can cover 3 additional channels spanning from the frontal lobe to the parietal lobe by a rotating joint. <br><br> While traditional SSVEP provides a promising signal-to-noise ratio (SNR) among EEG-based BCI systems, the paradigm that asks users to gaze at a visual stimulus with two eyes limits its real-world applications. For instance, it may not be ideal to ask a driver to shift both eyes’ attention to one visual stimulus. Therefore, we proposed the monocular display module, equipped with a transparent screen, as a solution to provide visual stimuli to induce SSVEP and also serve as a simple graphic user interface while reducing the impact on vision. The display is connected to an ESP32 board, features wireless communication via WiFi and Bluetooth, capacitive touch, and an IMU sensor. <br><br> Based on Gazo, we first assessed the SSVEP response and then focused on one prospective use case - the SSVEP-based person identification. There were 6 participants joined this study. They wore the Gazo and were asked to gaze at the 8Hz visual stimulus for 5 seconds and repeat 5 times. There was a 3-second break between each 5-second trial. The results showed a 7% SNR difference between the stimulating state and resting state, which demonstrates the feasibility of a single eyeglass-based SSVEP paradigm. In person identification, we built a machine learning pipeline with tree-based models utilizing an existing dataset (Y. Sun et al., 2024) to identify specific subjects. The average false positive rate (FPR) and false negative rate (FNR) of 5-fold cross-validation over 13 subjects were calculated, showing that both models perform well in person identification: decision tree has a FPR of 1.73% and a FNR of 16.15% while random forest has a FPR of 1.28% and a FNR of 13.85%. <br><br> Gazo, as a lightweight, low cost, and wearable BCI device, is designed and 3D-printed for easy setup and mobile usage across multiple use cases. The present study demonstrates its potential in user authentication through viable visual stimulation and a reliable authentication pipeline. The adopted modular design enhances adaptability for future developments, which could lower the production and development costs and position Gazo as a product with significant room for expansion and broad applications.",
        "video":"https://youtube.com/embed/M_aCQ9osfOo",
        "shorts": false,
        "otherMaterials": [
            {
                "name": "PDF",
                "link": "files/SfN24_Poster.pdf"
            }
        ],
        "selected": true,
        "pinned": true
    },
    {
        "id": "Glens",
        "name": "Glens",
        "projectYearMonth": "Mar 2024",
        "collaborator": "",
        "highlight": "",
        "intro": "Reading comprehension can be challenging for non-native speakers of a language, particularly when encountering unfamiliar topics or lengthy passages with complex sentence structures. Glens represents a proof-of-concept solution that utilizes an eye-tracking mechanism to detect instances where readers experience significant decreases in reading speed or repeatedly revisit specific sections. By capturing the texts that cause difficulties, the Glens leverages generative AI to produce tailored explanations that simplify sentence structures or rephrase content, aiming to provide adequate support.",
        "tags": [
            "Ubiquitous Computing"
        ],
        "details": "",
        "video":"https://youtube.com/embed/CZw1sfsocNA",
        "shorts": false,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": false
    },
    {
        "id": "CajonDoni",
        "name": "CajonDoni",
        "projectYearMonth": "Mar 2024",
        "collaborator": "Jou-An Chen, Shu-Wei Hsu, Tingrui Zhang",
        "highlight": "",
        "intro": "CajonDoni is a cajon game consisting of a mini cajon and a self-developed rhythm game. Using laser cutting, 3D printing, and electronic sensors, we designed a Cajon that can be played both individually and with the web-based game.",
        "tags": [
            "Ubiquitous Computing",
            "Digital Fabrication"
        ],
        "details": "",
        "video":"https://www.youtube.com/embed/GL00br0ahc0",
        "shorts": true,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": false
    },
    {
        "id": "Cornell-Tech-Musicbox",
        "name": "Cornell Tech Musicbox",
        "projectYearMonth": "Feb 2024",
        "collaborator": "Jou-An Chen, Shu-Wei Hsu, Tingrui Zhang",
        "highlight": "",
        "intro": "This digital fabrication project utilized laser cutting and 3D printing to create a Cornell Tech miniature music box. The hidden spinning plate holds a magnet that guides the red bus around the campus, creating a playful experience.",
        "tags": [
            "Digital Fabrication"
        ],
        "details": "The project we created is a Cornell Tech-themed music box. As the music plays, a red bus (a symbol of Roosevelt Island) circles the miniature campus. I led this project and took charge of building the spinning components, the box, and some decorative elements (e.g., the trees), while my teammates focused on modeling the three campus buildings. The box’s rounded corners require a bendable box side, so I applied a flexible pattern to achieve this. A spinning component is attached to the music box mechanism. With the spinning arm holding a magnet, the magnet will circle and guide the bus. The bottom of the red bus has an arc part and another magnet holder. This ensures the bus follows the track while circling and always faces the right direction.",
        "video":"https://www.youtube.com/embed/SCqQvCODOw8",
        "shorts": true,
        "otherMaterials": [
            {
                "name": "PDF",
                "link": "files/cornelltech_musicbox.pdf"
            }
        ],
        "selected": true,
        "pinned": true
    },
    {
        "id": "SmartSkate",
        "name": "SmartSkate",
        "projectYearMonth": "Feb 2024",
        "collaborator": "",
        "highlight": "",
        "intro": "SmartSkate is a wearable device designed for inline skaters to enhance their practice sessions. SmartSkate provides real-time alerts to users if they exceed safe speeds or are approaching obstacles. By connecting the device with a smartphone, SmartSkate generates practicing reports that allow skaters to keep track of their progress.",
        "tags": [
            "Ubiquitous Computing"
        ],
        "details": "",
        "video":"https://youtube.com/embed/fRBaFWnDZAE?si=e23n6KxSdMQmnVsq",
        "shorts": false,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": false
    }
]