[
    {
        "id": "Amber-Puzzle-Box",
        "name": "Amber Puzzle Box",
        "projectYearMonth": "Feb 2025",
        "collaborator": "",
        "intro": "Inspired by the delicate woodwork of a Yosegi puzzle box, I decided to work on a laser-cut version of the puzzle box. Yosegi-Zaiku（寄木細工）is a Japanese woodwork technique that utilizes the different colors of various types of wood to create geometric patterns on the wood surface. Traditional Yosegi Puzzle Boxes are mostly rectangular boxes, usually taking 4-27 steps to solve them. In my laser-cut version, I kept the repetitive geometric pattern and the puzzle elements to retain the Yosegi-like features and build a round shape box with self-designed mechanisms to ensure its uniqueness and originality. To match the theme of the rounded shape box, I utilized the spinning (rotating) feature and embedded a roller-bearing into the design. The mechanism features a box with an interlocking structure, and two additional layers of puzzle -- the nail stopper and the spinning magnet key, building on top of that.",
        "tags": [
            "Digital Fabrication"
        ],
        "selected": true,
        "pinned": true
    },
    {
        "id": "Snack-Keeper",
        "name": "Snack Keeper",
        "projectYearMonth": "Feb 2025",
        "collaborator": "",
        "intro": "Snack Keeper is a device designed to limit the number of times I open my snack cabinet to check or get snacks. The screen on the device will show the count of door being opened, once the door open count reached to two, a motor-controlled latch will locked the door for a set amount of time. ",
        "tags": [
            "Ubiquitous Computing"
        ],
        "selected": true,
        "pinned": false
    },
    {
        "id": "Walkwise",
        "name": "Walkwise",
        "projectYearMonth": "Dec 2024",
        "collaborator": "",
        "intro": "WalkWise is a conceptual product that is designed as a rollator walker add-on to guide users safely using a laser projector.",
        "tags": [
            "Ubiquitous Computing"
        ],
        "selected": true,
        "pinned": false
    },
    {
        "id": "Pong-Soccer",
        "name": "Pong Soccer",
        "projectYearMonth": "Dec 2024",
        "collaborator": "",
        "intro": "Pong Soccer is an interactive robot game where players are divided into two teams, yellow and blue, competing to score goals. The game’s objective is to guide a robot equipped with a soccer bin to the opposing team’s goal by throwing ping-pong balls into designated bins.",
        "tags": [
            "Human-Robot Interaction"
        ],
        "selected": true,
        "pinned": true
    },
    {
        "id": "Gazo",
        "name": "Gazo",
        "projectYearMonth": "Jul 2024",
        "collaborator": "",
        "intro": "Gazo is a 3D-printed EEG-based BCI device that features a portable, standalone, and monocle design. Gazo, consisting of a sensing headset, a display module ,and an EEG expansion module, is designed to accommodate a wide range of use cases that require mobile EEG capabilities.",
        "tags": [
            "Brain-Computer Interface",
            "Digital Fabrication",
            "Ubiquitous Computing"
        ],
        "selected": true,
        "pinned": true
    },
    {
        "id": "Glens",
        "name": "Glens",
        "projectYearMonth": "Mar 2024",
        "collaborator": "",
        "intro": "Reading comprehension can be challenging for non-native speakers of a language, particularly when encountering unfamiliar topics or lengthy passages with complex sentence structures. Glens represents a proof-of-concept solution that utilizes an eye-tracking mechanism to detect instances where readers experience significant decreases in reading speed or repeatedly revisit specific sections. By capturing the texts that cause difficulties, the Glens leverages generative AI to produce tailored explanations that simplify sentence structures or rephrase content, aiming to provide adequate support.",
        "tags": [
            "Ubiquitous Computing"
        ],
        "selected": true,
        "pinned": false
    },
    {
        "id": "CajonDoni",
        "name": "CajonDoni",
        "projectYearMonth": "Mar 2024",
        "collaborator": "Jou-An Chen, Shu-Wei Hsu, Tingrui Zhang",
        "intro": "CajonDoni is a cajon game consisting of a mini cajon and a self-developed rhythm game. Using laser cutting, 3D printing, and electronic sensors, we designed a Cajon that can be played both individually and with the web-based game.",
        "tags": [
            "Ubiquitous Computing"
        ],
        "selected": true,
        "pinned": false
    },
    {
        "id": "Cornell-Tech-Musicbox",
        "name": "Cornell Tech Musicbox",
        "projectYearMonth": "Feb 2024",
        "collaborator": "Jou-An Chen, Shu-Wei Hsu, Tingrui Zhang",
        "intro": "This digital fabrication project utilized laser cutting and 3D printing to create a Cornell Tech miniature music box. The hidden spinning plate holds a magnet that guides the red bus around the campus, creating a playful experience.",
        "tags": [
            "Digital Fabrication"
        ],
        "selected": true,
        "pinned": true
    },
    {
        "id": "SmartSkate",
        "name": "SmartSkate",
        "projectYearMonth": "Feb 2024",
        "collaborator": "",
        "intro": "SmartSkate is a wearable device designed for inline skaters to enhance their practice sessions. SmartSkate provides real-time alerts to users if they exceed safe speeds or are approaching obstacles. By connecting the device with a smartphone, SmartSkate generates practicing reports that allow skaters to keep track of their progress.",
        "tags": [
            "Ubiquitous Computing"
        ],
        "selected": true,
        "pinned": false
    }
]