[
    {
        "id": "Taiwan-Classic-Pinball",
        "name": "Taiwan Classic Pinball",
        "projectYearMonth": "Mar 2025",
        "collaborator": "Jou-An Chen",
        "intro": "Pinball is a classic and traditional game in many night markets across Taiwan. It is a tabletop game where players launch small marbles onto a tilted board, aiming to land them in numbered or colored holes. Traditionally, players use a Mahjong ruler to shoot the marble, trying to land the marbles either very focused or very scattered to win the best prize. In this project, we fabricated a pinball game board mainly by laser cutting featuring an embedded CLUE board and LEDs to enhance interactivity and engagement.",
        "tags": [
            "Ubiquitous Computing"
        ],
        "details": "",
        "video":"https://youtube.com/embed/dZYW2Gougwk",
        "shorts": false,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": false
    },
    {
        "id": "Amber-Puzzle-Box",
        "name": "Amber Puzzle Box",
        "projectYearMonth": "Feb 2025",
        "collaborator": "",
        "intro": "Inspired by the delicate woodwork of a Yosegi puzzle box, I decided to work on a laser-cut version of the puzzle box. Yosegi-Zaiku（寄木細工）is a Japanese woodwork technique that utilizes the different colors of various types of wood to create geometric patterns on the wood surface. Traditional Yosegi Puzzle Boxes are mostly rectangular boxes, usually taking 4-27 steps to solve them. In my laser-cut version, I kept the repetitive geometric pattern and the puzzle elements to retain the Yosegi-like features and build a round shape box with self-designed mechanisms to ensure its uniqueness and originality. To match the theme of the rounded shape box, I utilized the spinning (rotating) feature and embedded a roller-bearing into the design. The mechanism features a box with an interlocking structure, and two additional layers of puzzle -- the nail stopper and the spinning magnet key.",
        "tags": [
            "Digital Fabrication"
        ],
        "details": "The mechanism of the puzzle box can be divided into three parts: <b> the interlocking box, the nail stopper, and the spinning magnet key </b>. The bottom layer of the puzzle - the interlocking box, requires rotating the lid to a certain degree to pull the lid up. To lock this box, I added a nail stopper and two slots in the middle layer. To ensure the durability of the stopper, instead of assembling using wood sticks, the nail stopper is 3D-printed using PLA. To lift the nails from the slots, I decided to embed a small magnet on the upper layer; therefore, it will require attaching a thin piece of metal on the top of the nails to allow magnetic attraction (here I use the leg of a fastener). <br><br> The top layer was originally designed as a spinning plate that requires the player to spin the plate to the designated angle to lift the nails. However, as a puzzle, I figured the solution should be more complicated. Therefore, I changed the design to a 3-layer structure. The player will have to move the part with the magnet embedded from the first layer to the last layer, which is right above the magnetic nails to allow the magnetic force to lift the nails. I designed the moving part (the magnet keys) to be hidden in the top-most layer to maintain the cylinder shape when the box is locked, making it a bit tricky to directly pull it out. To move the part easily, the player can simply spin the plate quickly, <b>the centrifugal force</b> will bring the part with the magnet to the outer track, thus falling to the bottom layer. <br><br> One thing worth noting is that I designed the parts to be connected with the box at all times, which could greatly reduce the risk of the player losing any small parts when solving the puzzle, simply moving the part correctly without removing it will lead the player to solve the puzzle.",
        "video":"https://youtube.com/embed/4-LnBQ3DmpA",
        "shorts": false,
        "otherMaterials": [
            {
                "name": "Instructables",
                "link": "https://www.instructables.com/Designing-a-Laser-cut-Version-of-a-Yosegi-Puzzle-B/"
            }
        ],
        "selected": true,
        "pinned": true
    },
    {
        "id": "Snack-Keeper",
        "name": "Snack Keeper",
        "projectYearMonth": "Feb 2025",
        "collaborator": "",
        "intro": "Snack Keeper is a device designed to limit the number of times I open my snack cabinet to check or get snacks. The screen on the device will show the count of door being opened, once the door open count reached to two, a motor-controlled latch will locked the door for a set amount of time. ",
        "tags": [
            "Ubiquitous Computing"
        ],
        "details": "",
        "video":"https://youtube.com/embed/NMd0nqIMXc4?si=R9dacSJXgliFRTlI",
        "shorts": true,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": false
    },
    {
        "id": "Walkwise",
        "name": "Walkwise",
        "projectYearMonth": "Dec 2024",
        "collaborator": "Nebil  Oumer, Didem Ergin, Qiyuan Zhou",
        "intro": "WalkWise is a conceptual product that is designed as a rollator walker add-on to guide older adults safely using a laser projector.",
        "tags": [
            "Ubiquitous Computing"
        ],
        "details": "",
        "video":"",
        "shorts": false,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": false
    },
    {
        "id": "Pong-Soccer",
        "name": "Pong Soccer",
        "projectYearMonth": "Dec 2024",
        "collaborator": "Jou-An Chen, Qiyuan Zhou, Nicholas Huang, Siyan Wang",
        "intro": "Pong Soccer is an interactive robot game designed for the K-12 initiative. Students are divided into two teams, yellow and blue, competing to score goals. The game’s objective is to guide a robot equipped with a soccer bin to the opposing team’s goal by throwing ping-pong balls into designated bins.",
        "tags": [
            "Human-Robot Interaction"
        ],
        "details": "The inspiration for the robot’s behavior draws from popular sports such as soccer, basketball, and ping pong. In this game, the robot mimics the behavior of a soccer ball, with the participants acting as players who, instead of kicking a ball, throw ping-pong balls into the robot’s designated bins to control its movement on the field. <br><br> The robot interacts with players through a combination of movement, lights, and sound. At the start of the game, the robot emits a honking sound to signal the start of the game. When a player throws a ball into the yellow bin, the robot responds with a “yellow team scores” audio, accompanied by a yellow light flash and movement toward the blue team’s goal. Similarly, when a ball is thrown into the blue team’s bin, the robot moves toward the yellow team’s goal and signals with blue lights and sound. When a team scores by reaching the opposing team’s goal, the robot announces the score with a corresponding sound and flashes the team’s color lights multiple times to celebrate the achievement. <br><br> The robot control architecture is made up of three subsystems: <b> the Ball Detection Subsystem, the Navigate Subsystem, and the Communication Subsystem </b>. The Ball Detection and Communication Subsystems run on a Raspberry Pi, which is connected to two motion sensors placed on either side of the soccer bin. These sensors detect when a ball enters the bin by measuring if the proximity exceeds a set threshold. Once a ball is detected, the Raspberry Pi sends a WebSocket message to the ROS2 node on the TurtleBot4 robot. The robot then uses this message to decide the direction and distance it needs to move. The Raspberry Pi server also keeps track of how many times each team scores to determine the winner. This architecture decouples the robot’s navigation and sensor detection subsystems, making it well-suited for the game by allowing greater flexibility and robustness in using sensor data. It ensures real-time responsiveness to player actions while providing reliable and accurate detection.",
        "video":"https://youtube.com/embed/c-LI4i0e-zc",
        "shorts": true,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": true
    },
    {
        "id": "Gazo",
        "name": "Gazo",
        "projectYearMonth": "Jul 2024",
        "collaborator": "",
        "intro": "Gazo is a 3D-printed EEG-based BCI device that features a portable, standalone, and monocle design. Gazo, consisting of a sensing headset, a display module ,and an EEG expansion module, is designed to accommodate a wide range of use cases that require mobile EEG capabilities.",
        "tags": [
            "Brain-Computer Interface",
            "Digital Fabrication",
            "Ubiquitous Computing"
        ],
        "details": "",
        "video":"https://youtube.com/embed/M_aCQ9osfOo",
        "shorts": false,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": true
    },
    {
        "id": "Glens",
        "name": "Glens",
        "projectYearMonth": "Mar 2024",
        "collaborator": "",
        "intro": "Reading comprehension can be challenging for non-native speakers of a language, particularly when encountering unfamiliar topics or lengthy passages with complex sentence structures. Glens represents a proof-of-concept solution that utilizes an eye-tracking mechanism to detect instances where readers experience significant decreases in reading speed or repeatedly revisit specific sections. By capturing the texts that cause difficulties, the Glens leverages generative AI to produce tailored explanations that simplify sentence structures or rephrase content, aiming to provide adequate support.",
        "tags": [
            "Ubiquitous Computing"
        ],
        "details": "",
        "video":"https://youtube.com/embed/CZw1sfsocNA",
        "shorts": false,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": false
    },
    {
        "id": "CajonDoni",
        "name": "CajonDoni",
        "projectYearMonth": "Mar 2024",
        "collaborator": "Jou-An Chen, Shu-Wei Hsu, Tingrui Zhang",
        "intro": "CajonDoni is a cajon game consisting of a mini cajon and a self-developed rhythm game. Using laser cutting, 3D printing, and electronic sensors, we designed a Cajon that can be played both individually and with the web-based game.",
        "tags": [
            "Ubiquitous Computing"
        ],
        "details": "",
        "video":"https://www.youtube.com/embed/GL00br0ahc0",
        "shorts": true,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": false
    },
    {
        "id": "Cornell-Tech-Musicbox",
        "name": "Cornell Tech Musicbox",
        "projectYearMonth": "Feb 2024",
        "collaborator": "Jou-An Chen, Shu-Wei Hsu, Tingrui Zhang",
        "intro": "This digital fabrication project utilized laser cutting and 3D printing to create a Cornell Tech miniature music box. The hidden spinning plate holds a magnet that guides the red bus around the campus, creating a playful experience.",
        "tags": [
            "Digital Fabrication"
        ],
        "details": "",
        "video":"https://www.youtube.com/embed/SCqQvCODOw8",
        "shorts": true,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": true
    },
    {
        "id": "SmartSkate",
        "name": "SmartSkate",
        "projectYearMonth": "Feb 2024",
        "collaborator": "",
        "intro": "SmartSkate is a wearable device designed for inline skaters to enhance their practice sessions. SmartSkate provides real-time alerts to users if they exceed safe speeds or are approaching obstacles. By connecting the device with a smartphone, SmartSkate generates practicing reports that allow skaters to keep track of their progress.",
        "tags": [
            "Ubiquitous Computing"
        ],
        "details": "",
        "video":"https://youtube.com/embed/fRBaFWnDZAE?si=e23n6KxSdMQmnVsq",
        "shorts": false,
        "otherMaterials": [
            {
                "name": "",
                "link": ""
            }
        ],
        "selected": true,
        "pinned": false
    }
]